espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/si1133/src/sl_si1133.c
/***************************************************************************//**
 * @file
 * @brief Driver for the Si1133 Ambient Light and UV sensor
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#include <stdint.h>
#include "sl_i2cspm.h"
#include "sl_sleeptimer.h"
#include "sl_si1133.h"

/***************************************************************************//**
 * @defgroup Si1133 SI1133 - Ambient Light and UV Index Sensor
 * @{
 * @brief Driver for the Silicon Labs Si1133 Ambient Light and UV sensor
 ******************************************************************************/

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */

/***************************************************************************//**
 * @brief
 *    Structure to store the calculation coefficients
 ******************************************************************************/
typedef struct {
  int16_t     info;           /**< Info                              */
  uint16_t    mag;            /**< Magnitude                         */
} sl_si1133_coeff_t;

/***************************************************************************//**
 * @brief
 *    Structure to store the coefficients used for Lux calculation
 ******************************************************************************/
typedef struct {
  sl_si1133_coeff_t   coeff_high[4];   /**< High amplitude coefficients */
  sl_si1133_coeff_t   coeff_low[9];    /**< Low amplitude coefficients  */
} sl_si1133_lux_coeff_t;

/***************************************************************************//**
 * @brief
 *    Coefficients for lux calculation
 ******************************************************************************/
static sl_si1133_lux_coeff_t lk = {
  { {     0, 209 },           /**< coeff_high[0]   */
    {  1665, 93  },           /**< coeff_high[1]   */
    {  2064, 65  },           /**< coeff_high[2]   */
    { -2671, 234 } },         /**< coeff_high[3]   */
  { {     0, 0   },           /**< coeff_low[0]    */
    {  1921, 29053 },         /**< coeff_low[1]    */
    { -1022, 36363 },         /**< coeff_low[2]    */
    {  2320, 20789 },         /**< coeff_low[3]    */
    {  -367, 57909 },         /**< coeff_low[4]    */
    { -1774, 38240 },         /**< coeff_low[5]    */
    {  -608, 46775 },         /**< coeff_low[6]    */
    { -1503, 51831 },         /**< coeff_low[7]    */
    { -1886, 58928 } }        /**< coeff_low[8]    */
};

/***************************************************************************//**
 * @brief
 *    Coefficients for UV index calculation
 ******************************************************************************/
static sl_si1133_coeff_t uk[2] = {
  { 1281, 30902 },            /**< coeff[0]        */
  { -638, 46301 }             /**< coeff[1]        */
};

/***************************************************************************//**
 * @brief
 *    SI1133 i2c address
 ******************************************************************************/
#define SI1133_I2C_DEVICE_BUS_ADDRESS   (0x55)

/***************************************************************************//**
 * @brief
 *    Helper functions and values required to calculate lux and UV index
 ******************************************************************************/
#define X_ORDER_MASK            0x0070
#define Y_ORDER_MASK            0x0007
#define SIGN_MASK               0x0080
#define get_x_order(m)          ( (m & X_ORDER_MASK) >> 4)
#define get_y_order(m)          ( (m & Y_ORDER_MASK)      )
#define get_sign(m)             ( (m & SIGN_MASK) >> 7)

#define UV_INPUT_FRACTION       15
#define UV_OUTPUT_FRACTION      12
#define UV_NUMCOEFF             2

#define ADC_THRESHOLD           16000
#define INPUT_FRACTION_HIGH     7
#define INPUT_FRACTION_LOW      15
#define LUX_OUTPUT_FRACTION     12
#define NUMCOEFF_LOW            9
#define NUMCOEFF_HIGH           4

// Local prototypes
static sl_status_t sl_si1133_wait_until_sleep(sl_i2cspm_t *i2cspm);
static sl_status_t sl_si1133_send_command(sl_i2cspm_t *i2cspm, uint8_t command);
static int32_t sl_si1133_compute_uvi(int32_t uv, sl_si1133_coeff_t *uk);
static int32_t sl_si1133_compute_lux(int32_t vis_high, int32_t vis_low, int32_t ir, sl_si1133_lux_coeff_t *lk);
static int32_t sl_si1133_calculate_inner_polynomial(int32_t input, int8_t fraction, uint16_t mag, int8_t  shift);
static int32_t sl_si1133_calculate_evaluation_polynomial(int32_t x, int32_t y, uint8_t input_fraction, uint8_t output_fraction, uint8_t num_coeff, sl_si1133_coeff_t *kp);
/** @endcond */

/**************************************************************************//**
 *    Initializes the Si1133 chip
 *****************************************************************************/
sl_status_t sl_si1133_init(sl_i2cspm_t *i2cspm)
{
  sl_status_t retval;

  /* Do not access the Si1133 earlier than 25 ms from power-up */
  sl_sleeptimer_delay_millisecond(50);

  /* Reset the sensor. The reset function implements the necessary delays after reset. */
  retval = sl_si1133_reset(i2cspm);

  retval += sl_si1133_set_parameter(i2cspm, SI1133_PARAM_CH_LIST, 0x0f);
  retval += sl_si1133_set_parameter(i2cspm, SI1133_PARAM_ADCCONFIG0, 0x78);
  retval += sl_si1133_set_parameter(i2cspm, SI1133_PARAM_ADCSENS0, 0x71);
  retval += sl_si1133_set_parameter(i2cspm, SI1133_PARAM_ADCPOST0, 0x40);
  retval += sl_si1133_set_parameter(i2cspm, SI1133_PARAM_ADCCONFIG1, 0x4d);
  retval += sl_si1133_set_parameter(i2cspm, SI1133_PARAM_ADCSENS1, 0xe1);
  retval += sl_si1133_set_parameter(i2cspm, SI1133_PARAM_ADCPOST1, 0x40);
  retval += sl_si1133_set_parameter(i2cspm, SI1133_PARAM_ADCCONFIG2, 0x41);
  retval += sl_si1133_set_parameter(i2cspm, SI1133_PARAM_ADCSENS2, 0xe1);
  retval += sl_si1133_set_parameter(i2cspm, SI1133_PARAM_ADCPOST2, 0x50);
  retval += sl_si1133_set_parameter(i2cspm, SI1133_PARAM_ADCCONFIG3, 0x4d);
  retval += sl_si1133_set_parameter(i2cspm, SI1133_PARAM_ADCSENS3, 0x87);
  retval += sl_si1133_set_parameter(i2cspm, SI1133_PARAM_ADCPOST3, 0x40);

