espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/si1133/src/sl_si1133.c
  retval += sl_si1133_write_register(i2cspm, SI1133_REG_IRQ_ENABLE, 0x0f);

  if (retval != SL_STATUS_OK) {
    retval = SL_STATUS_INITIALIZATION;
  }

  return retval;
}

/***************************************************************************//**
 *    Stops the measurements on all channel and waits until the chip
 *    goes to sleep state.
 ******************************************************************************/
sl_status_t sl_si1133_deinit(sl_i2cspm_t *i2cspm)
{
  sl_status_t retval;

  retval = sl_si1133_set_parameter(i2cspm, SI1133_PARAM_CH_LIST, 0x3f);
  if (retval != SL_STATUS_OK) {
    return retval;
  }
  retval = sl_si1133_pause_measurement(i2cspm);
  if (retval != SL_STATUS_OK) {
    return retval;
  }
  retval = sl_si1133_wait_until_sleep(i2cspm);
  return retval;
}

/***************************************************************************//**
 *    Measure lux and UV index using the Si1133 sensor
 ******************************************************************************/
sl_status_t sl_si1133_measure_lux_uvi(sl_i2cspm_t *i2cspm, float *lux, float *uvi)
{
  sl_si1133_samples_t samples;
  sl_status_t retval;
  uint8_t response;

  /* Force measurement */
  retval = sl_si1133_force_measurement(i2cspm);

  /* Wait while the sensor does the conversion */
  sl_sleeptimer_delay_millisecond(200);

  /* Check if the measurement finished, if not then wait */
  retval += sl_si1133_read_register(i2cspm, SI1133_REG_IRQ_STATUS, &response);
  while ( response != 0x0F ) {
    sl_sleeptimer_delay_millisecond(5);
    retval += sl_si1133_read_register(i2cspm, SI1133_REG_IRQ_STATUS, &response);
  }

  /* Get the results */
  sl_si1133_read_samples(i2cspm, &samples);

  /* Convert the readings to lux */
  *lux = (float) sl_si1133_compute_lux(samples.ch1, samples.ch3, samples.ch2, &lk);
  *lux = *lux / (1 << LUX_OUTPUT_FRACTION);

  /* Convert the readings to UV index */
  *uvi = (float) sl_si1133_compute_uvi(samples.ch0, uk);
  *uvi = *uvi / (1 << UV_OUTPUT_FRACTION);

  return retval;
}

/***************************************************************************//**
 *    Reads register from the Si1133 sensor
 ******************************************************************************/
sl_status_t sl_si1133_read_register(sl_i2cspm_t *i2cspm, uint8_t reg, uint8_t *data)
{
  I2C_TransferSeq_TypeDef seq;
  I2C_TransferReturn_TypeDef ret;
  uint8_t i2c_write_data[1];
  sl_status_t retval;

  retval = SL_STATUS_OK;

  seq.addr = SI1133_I2C_DEVICE_BUS_ADDRESS << 1;
  seq.flags = I2C_FLAG_WRITE_READ;
  /* Select register to start reading from */
  i2c_write_data[0] = reg;
  seq.buf[0].data = i2c_write_data;
  seq.buf[0].len = 1;
  /* Select length of data to be read */
  seq.buf[1].data = data;
  seq.buf[1].len = 1;

  ret = I2CSPM_Transfer(i2cspm, &seq);
  if ( ret != i2cTransferDone ) {
    *data = 0xff;
    retval = SL_STATUS_TRANSMIT;
  }

  return retval;
}

/***************************************************************************//**
 *    Writes register in the Si1133 sensor
 ******************************************************************************/
sl_status_t sl_si1133_write_register(sl_i2cspm_t *i2cspm, uint8_t reg, uint8_t data)
{
  I2C_TransferSeq_TypeDef seq;
  I2C_TransferReturn_TypeDef ret;
  uint8_t i2c_write_data[2];
  uint8_t i2c_read_data[1];
  sl_status_t retval;

  retval = SL_STATUS_OK;

  seq.addr = SI1133_I2C_DEVICE_BUS_ADDRESS << 1;
  seq.flags = I2C_FLAG_WRITE;
  /* Select register and data to write */
  i2c_write_data[0] = reg;
  i2c_write_data[1] = data;
  seq.buf[0].data = i2c_write_data;
  seq.buf[0].len = 2;
  seq.buf[1].data = i2c_read_data;
  seq.buf[1].len = 0;

  ret = I2CSPM_Transfer(i2cspm, &seq);
  if ( ret != i2cTransferDone ) {
    retval = SL_STATUS_TRANSMIT;
  }

  return retval;
}

/***************************************************************************//**
 *    Writes a block of data to the Si1133 sensor.
 ******************************************************************************/
sl_status_t sl_si1133_write_register_block(sl_i2cspm_t *i2cspm, uint8_t reg, uint8_t length, const uint8_t *data)
{
  I2C_TransferSeq_TypeDef seq;
  I2C_TransferReturn_TypeDef ret;
  uint8_t i2c_write_data[10];
  uint8_t i2c_read_data[1];
  uint8_t i;
  sl_status_t retval;

  retval = SL_STATUS_OK;

  seq.addr = SI1133_I2C_DEVICE_BUS_ADDRESS << 1;
  seq.flags = I2C_FLAG_WRITE;
  /* Select register to start writing to*/
  i2c_write_data[0] = reg;
  for ( i = 0; i < length; i++ ) {
    i2c_write_data[i + 1] = data[i];
  }
  seq.buf[0].data = i2c_write_data;
  seq.buf[0].len = length + 1;
  seq.buf[1].data = i2c_read_data;
  seq.buf[1].len = 0;

  ret = I2CSPM_Transfer(i2cspm, &seq);
  if ( ret != i2cTransferDone ) {
    retval = SL_STATUS_TRANSMIT;
  }

  return retval;
}

/***************************************************************************//**
 *    Reads a block of data from the Si1133 sensor.
 ******************************************************************************/
sl_status_t sl_si1133_read_register_block(sl_i2cspm_t *i2cspm, uint8_t reg, uint8_t length, uint8_t *data)
{
  I2C_TransferSeq_TypeDef seq;
  I2C_TransferReturn_TypeDef ret;
  uint8_t i2c_write_data[1];
  sl_status_t retval;

  retval = SL_STATUS_OK;

  seq.addr = SI1133_I2C_DEVICE_BUS_ADDRESS << 1;
  seq.flags = I2C_FLAG_WRITE_READ;
  /* Select register to start reading from */
  i2c_write_data[0] = reg;
  seq.buf[0].data = i2c_write_data;
  seq.buf[0].len = 1;
  /* Select length of data to be read */
  seq.buf[1].data = data;
  seq.buf[1].len = length;

  ret = I2CSPM_Transfer(i2cspm, &seq);
  if ( ret != i2cTransferDone ) {
    retval = SL_STATUS_TRANSMIT;
  }

  return retval;
}

/***************************************************************************//**
 * @brief
 *    Waits until the Si1133 is sleeping before proceeding
 *
 * @return
 *    @retval SL_STATUS_OK Success
 *    @retval SL_STATUS_TRANSMIT I2C transmit failure
 ******************************************************************************/
sl_status_t sl_si1133_wait_until_sleep(sl_i2cspm_t *i2cspm)
{
  uint32_t ret;
  uint8_t response;
  uint8_t count = 0;
  sl_status_t retval;

  retval = SL_STATUS_OK;

  /* This loops until the Si1133 is known to be in its sleep state  */
  /* or if an i2c error occurs                                      */
  while ( count < 5 ) {
    ret = sl_si1133_read_register(i2cspm, SI1133_REG_RESPONSE0, &response);
    if ( (response & SI1133_RSP0_CHIPSTAT_MASK) == SI1133_RSP0_SLEEP ) {
      break;
    }

