espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/si1133/src/sl_si1133.c
    if ( ret != SL_STATUS_OK ) {
      return ret;
    }

    count++;
  }

  return retval;
}

/***************************************************************************//**
 *    Resets the Si1133
 ******************************************************************************/
sl_status_t sl_si1133_reset(sl_i2cspm_t *i2cspm)
{
  sl_status_t retval;

  /* Perform the Reset Command */
  retval = sl_si1133_write_register(i2cspm, SI1133_REG_COMMAND, SI1133_CMD_RESET);

  /* Allow a minimum of 25ms for Si1133 sensor to perform initial       */
  /* startup sequence                                                   */
  sl_sleeptimer_delay_millisecond(30);

  return retval;
}

/***************************************************************************//**
 *    Helper function to send a command to the Si1133
 ******************************************************************************/
sl_status_t sl_si1133_send_command(sl_i2cspm_t *i2cspm, uint8_t command)
{
  uint8_t response;
  uint8_t response_stored;
  uint8_t count = 0;
  uint32_t ret;

  /* Get the response register contents */
  ret = sl_si1133_read_register(i2cspm, SI1133_REG_RESPONSE0, &response_stored);
  if ( ret != SL_STATUS_OK ) {
    return ret;
  }

  response_stored = response_stored & SI1133_RSP0_COUNTER_MASK;

  /* Double-check the response register is consistent */
  while ( count < 5 ) {
    ret = sl_si1133_wait_until_sleep(i2cspm);
    if ( ret != SL_STATUS_OK ) {
      return ret;
    }
    /* Skip if the command is RESET COMMAND COUNTER */
    if ( command == SI1133_CMD_RESET_CMD_CTR ) {
      break;
    }

    ret = sl_si1133_read_register(i2cspm, SI1133_REG_RESPONSE0, &response);

    if ( (response & SI1133_RSP0_COUNTER_MASK) == response_stored ) {
      break;
    } else {
      if ( ret != SL_STATUS_OK ) {
        return ret;
      } else {
        response_stored = response & SI1133_RSP0_COUNTER_MASK;
      }
    }

    count++;
  }

  /* Send the command */
  ret = sl_si1133_write_register(i2cspm, SI1133_REG_COMMAND, command);
  if ( ret != SL_STATUS_OK ) {
    return ret;
  }

  count = 0;
  /* Expect a change in the response register */
  while ( count < 5 ) {
    /* Skip if the command is RESET COMMAND COUNTER */
    if ( command == SI1133_CMD_RESET_CMD_CTR ) {
      break;
    }

    ret = sl_si1133_read_register(i2cspm, SI1133_REG_RESPONSE0, &response);
    if ( (response & SI1133_RSP0_COUNTER_MASK) != response_stored ) {
      break;
    } else {
      if ( ret != SL_STATUS_OK ) {
        return ret;
      }
    }

    count++;
  }

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Sends a RESET COMMAND COUNTER command to the Si1133
 ******************************************************************************/
sl_status_t sl_si1133_reset_command_counter(sl_i2cspm_t *i2cspm)
{
  return sl_si1133_send_command(i2cspm, SI1133_CMD_RESET_CMD_CTR);
}

/*************************************************************************//**
 *    Sends a FORCE command to the Si1133
 ******************************************************************************/
sl_status_t sl_si1133_force_measurement(sl_i2cspm_t *i2cspm)
{
  return sl_si1133_send_command(i2cspm, SI1133_CMD_FORCE_CH);
}

/***************************************************************************//**
 *    Sends a START command to the Si1133
 ******************************************************************************/
sl_status_t sl_si1133_start_measurement(sl_i2cspm_t *i2cspm)
{
  return sl_si1133_send_command(i2cspm, SI1133_CMD_START);
}

/***************************************************************************//**
 *    Reads a parameter from the Si1133
 ******************************************************************************/
sl_status_t sl_si1133_read_parameter(sl_i2cspm_t *i2cspm, uint8_t address)
{
  uint8_t retval;
  uint8_t cmd;

  cmd = 0x40 + (address & 0x3F);

  retval = sl_si1133_send_command(i2cspm, cmd);
  if ( retval != SL_STATUS_OK ) {
    return retval;
  }

  sl_si1133_read_register(i2cspm, SI1133_REG_RESPONSE1, &retval);

  return retval;
}

/***************************************************************************//**
 *    Writes a byte to an Si1133 Parameter
 ******************************************************************************/
sl_status_t sl_si1133_set_parameter(sl_i2cspm_t *i2cspm, uint8_t address, uint8_t value)
{
  sl_status_t retval;
  uint8_t buffer[2];
  uint8_t response_stored;
  uint8_t response;
  uint8_t count;

  retval = sl_si1133_wait_until_sleep(i2cspm);
  if ( retval != SL_STATUS_OK ) {
    return retval;
  }

  sl_si1133_read_register(i2cspm, SI1133_REG_RESPONSE0, &response_stored);
  response_stored &= SI1133_RSP0_COUNTER_MASK;

  buffer[0] = value;
  buffer[1] = 0x80 + (address & 0x3F);

  retval = sl_si1133_write_register_block(i2cspm, SI1133_REG_HOSTIN0, 2, (uint8_t*) buffer);
  if ( retval != SL_STATUS_OK ) {
    return retval;
  }

  /* Wait for command to finish */
  count = 0;
  /* Expect a change in the response register */
  while ( count < 5 ) {
    retval = sl_si1133_read_register(i2cspm, SI1133_REG_RESPONSE0, &response);
    if ( (response & SI1133_RSP0_COUNTER_MASK) != response_stored ) {
      break;
    } else {
      if ( retval != SL_STATUS_OK ) {
        return retval;
      }
    }

    count++;
  }

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Sends a PAUSE command to the Si1133
 ******************************************************************************/
sl_status_t sl_si1133_pause_measurement(sl_i2cspm_t *i2cspm)
{
  return sl_si1133_send_command(i2cspm, SI1133_CMD_PAUSE_CH);
}

/***************************************************************************//**
 *    Read samples from the Si1133 chip
 ******************************************************************************/
sl_status_t sl_si1133_read_samples(sl_i2cspm_t *i2cspm, sl_si1133_samples_t *samples)
{
  uint8_t buffer[13];
  sl_status_t retval;

  retval = sl_si1133_read_register_block(i2cspm, SI1133_REG_IRQ_STATUS, 13, buffer);

  samples->irq_status = buffer[0];

