espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/si1133/src/sl_si1133.c
  samples->ch0 = buffer[1] << 16;
  samples->ch0 |= buffer[2] << 8;
  samples->ch0 |= buffer[3];
  if ( samples->ch0 & 0x800000 ) {
    samples->ch0 |= 0xFF000000;
  }

  samples->ch1 = buffer[4] << 16;
  samples->ch1 |= buffer[5] << 8;
  samples->ch1 |= buffer[6];
  if ( samples->ch1 & 0x800000 ) {
    samples->ch1 |= 0xFF000000;
  }

  samples->ch2 = buffer[7] << 16;
  samples->ch2 |= buffer[8] << 8;
  samples->ch2 |= buffer[9];
  if ( samples->ch2 & 0x800000 ) {
    samples->ch2 |= 0xFF000000;
  }

  samples->ch3 = buffer[10] << 16;
  samples->ch3 |= buffer[11] << 8;
  samples->ch3 |= buffer[12];
  if ( samples->ch3 & 0x800000 ) {
    samples->ch3 |= 0xFF000000;
  }

  return retval;
}

/***************************************************************************//**
 *    Reads Hardware ID from the SI1133 sensor
 ******************************************************************************/
sl_status_t sl_si1133_get_hardware_id(sl_i2cspm_t *i2cspm, uint8_t *hardwareID)
{
  sl_status_t retval;

  retval = sl_si1133_read_register(i2cspm, SI1133_REG_PART_ID, hardwareID);

  return retval;
}

/***************************************************************************//**
 *    Retrieve the sample values from the chip and convert them
 *    to lux and UV index values
 ******************************************************************************/
sl_status_t sl_si1133_get_measurement(sl_i2cspm_t *i2cspm, float *lux, float *uvi)
{
  sl_si1133_samples_t samples;
  sl_status_t retval;

  /* Get the results */
  retval = sl_si1133_read_samples(i2cspm, &samples);

  /* Convert the readings to lux */
  *lux = (float) sl_si1133_compute_lux(samples.ch1, samples.ch3, samples.ch2, &lk);
  *lux = *lux / (1 << LUX_OUTPUT_FRACTION);

  /* Convert the readings to UV index */
  *uvi = (float) sl_si1133_compute_uvi(samples.ch0, uk);
  *uvi = *uvi / (1 << UV_OUTPUT_FRACTION);

  return retval;
}

/***************************************************************************//**
 *    Reads the interrupt status register of the device
 ******************************************************************************/
sl_status_t sl_si1133_get_irq_status(sl_i2cspm_t *i2cspm, uint8_t *irqStatus)
{
  sl_status_t retval;

  /* Read the IRQ status register */
  retval = sl_si1133_read_register(i2cspm, SI1133_REG_IRQ_STATUS, irqStatus);

  return retval;
}

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */

/***************************************************************************//**
 * @brief
 *    Helper function to polynomial calculations
 * @return
 *    The calculated innter polynomial
 ******************************************************************************/
static int32_t sl_si1133_calculate_inner_polynomial(int32_t input, int8_t fraction, uint16_t mag, int8_t shift)
{
  int32_t value;

  if ( shift < 0 ) {
    value = ( (input << fraction) / mag) >> -shift;
  } else {
    value = ( (input << fraction) / mag) << shift;
  }

  return value;
}

/***************************************************************************//**
 * @brief
 *    Polynomial evaluation function to calculate lux and UV index
 *
 * @return
 *    Scaled results
 ******************************************************************************/
static int32_t sl_si1133_calculate_evaluation_polynomial(int32_t x, int32_t y, uint8_t input_fraction, uint8_t output_fraction, uint8_t num_coeff, sl_si1133_coeff_t *kp)
{
  uint8_t info, x_order, y_order, counter;
  int8_t sign, shift;
  uint16_t mag;
  int32_t output = 0, x1, x2, y1, y2;

  for ( counter = 0; counter < num_coeff; counter++ ) {
    info = kp->info;
    x_order = get_x_order(info);
    y_order = get_y_order(info);

    shift = ( (uint16_t) kp->info & 0xff00) >> 8;
    shift ^= 0x00ff;
    shift += 1;
    shift = -shift;

    mag = kp->mag;

    if ( get_sign(info) ) {
      sign = -1;
    } else {
      sign = 1;
    }

    if ( (x_order == 0) && (y_order == 0) ) {
      output += sign * mag << output_fraction;
    } else {
      if ( x_order > 0 ) {
        x1 = sl_si1133_calculate_inner_polynomial(x, input_fraction, mag, shift);
        if ( x_order > 1 ) {
          x2 = sl_si1133_calculate_inner_polynomial(x, input_fraction, mag, shift);
        } else {
          x2 = 1;
        }
      } else {
        x1 = 1;
        x2 = 1;
      }

      if ( y_order > 0 ) {
        y1 = sl_si1133_calculate_inner_polynomial(y, input_fraction, mag, shift);
        if ( y_order > 1 ) {
          y2 = sl_si1133_calculate_inner_polynomial(y, input_fraction, mag, shift);
        } else {
          y2 = 1;
        }
      } else {
        y1 = 1;
        y2 = 1;
      }

      output += sign * x1 * x2 * y1 * y2;
    }

    kp++;
  }

  if ( output < 0 ) {
    output = -output;
  }

  return output;
}

/***************************************************************************//**
 * @brief
 *    Compute UV index
 *
 * @param[in] uv
 *    UV sensor raw data
 *
 * @param[in] uk
 *    UV calculation coefficients
 *
 * @return
 *    UV index scaled by UV_OUPTUT_FRACTION
 ******************************************************************************/
static int32_t sl_si1133_compute_uvi(int32_t uv, sl_si1133_coeff_t *uk)
{
  int32_t uvi;

  uvi = sl_si1133_calculate_evaluation_polynomial(0, uv, UV_INPUT_FRACTION, UV_OUTPUT_FRACTION, UV_NUMCOEFF, uk);

  return uvi;
}

/***************************************************************************//**
 * @brief
 *    Compute lux value
 *
 * @param[in] vis_high
 *    Visible light sensor raw data
 *
 * @param[in] vis_low
 *    Visible light sensor raw data
 *
 * @param[in] ir
 *    Infrared sensor raw data
 *
 * @param[in] lk
 *    Lux calculation coefficients
 *
 * @return
 *    Lux value scaled by LUX_OUPTUT_FRACTION
 ******************************************************************************/
static int32_t sl_si1133_compute_lux(int32_t vis_high, int32_t vis_low, int32_t ir, sl_si1133_lux_coeff_t *lk)
{
  int32_t lux;

  if ( (vis_high > ADC_THRESHOLD) || (ir > ADC_THRESHOLD) ) {
    lux = sl_si1133_calculate_evaluation_polynomial(vis_high,
                                                    ir,
                                                    INPUT_FRACTION_HIGH,
                                                    LUX_OUTPUT_FRACTION,
                                                    NUMCOEFF_HIGH,
                                                    &(lk->coeff_high[0]) );
  } else {
    lux = sl_si1133_calculate_evaluation_polynomial(vis_low,
                                                    ir,
                                                    INPUT_FRACTION_LOW,
                                                    LUX_OUTPUT_FRACTION,
                                                    NUMCOEFF_LOW,
                                                    &(lk->coeff_low[0]) );
  }

  return lux;
}
/** @endcond */
/** @} {end defgroup Si1133} */
